const all_cailiao = {
    // 原材料
    yuanliaoLv1: {
        '0001': {
            name: '棉线', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/mianxian', // 图片 
            desc: '低等材料，可用于合成棉布', // 物品描述
            upgrateId: '0101', // 升级后
        },
        '0002': {
            name: '铁矿', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/tiekuang', // 图片 
            desc: '低等材料，可用于合成铁', // 物品描述
            upgrateId: '0102', // 升级后
        },
        '0003': {
            name: '玉石', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yushi', // 图片 
            desc: '低等材料，可用于合成玉', // 物品描述
            upgrateId: '0103', // 升级后
        },
        '0004': {
            name: '檀木料', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/chanmuliao', // 图片 
            desc: '低等材料，可用于合成檀木', // 物品描述
            upgrateId: '0104', // 升级后
        },
        '0005': {
            name: '软皮料', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/ruanpiliao', // 图片 
            desc: '低等材料，可用于合成软皮', // 物品描述
            upgrateId: '0105', // 升级后
        }
    },
    yuanliaoLv2: {
        '0006': {
            name: '丝线', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/sixian', // 图片 
            desc: '高等材料，可用于合成丝绸', // 物品描述
            upgrateId: '0106', // 升级后
        },
        '0007': {
            name: '银矿', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yinkuang', // 图片 
            desc: '高等材料，可用于合成银', // 物品描述
            upgrateId: '0107', // 升级后
        },
        '0008': {
            name: '水晶石', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/shuijingshi', // 图片 
            desc: '高等材料，可用于合成水晶', // 物品描述
            upgrateId: '0108', // 升级后
        },
        '0009': {
            name: '乌木料', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/wumuliao', // 图片 
            desc: '高等材料，可用于合成乌木', // 物品描述
            upgrateId: '0109', // 升级后
        },
        '0010': {
            name: '硬皮料', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yingpiliao', // 图片 
            desc: '高等材料，可用于合成硬皮', // 物品描述
            upgrateId: '0110', // 升级后
        }
    },
    
    // chengpin材料
    chengpincailiaoLv1: {
        '0101': {
            name: '一等棉布', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/mianbu', // 图片 
            desc: '一匹布，常用于打造低等装备', // 物品描述
            lvl: 1,
            upgrateId: '01012', // 升级后
        },
        '01012': {
            name: '二等棉布', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/mianbu', // 图片 
            desc: '一匹布，常用于打造低等装备', // 物品描述
            lvl: 2,
            upgrateId: '01013', // 升级后
        },
        '01013': {
            name: '三等棉布', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/mianbu', // 图片 
            desc: '一匹布，常用于打造低等装备', // 物品描述
            lvl: 3,
            upgrateId: '01014', // 升级后
        },
        '01014': {
            name: '四等棉布', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/mianbu', // 图片 
            desc: '一匹布，常用于打造低等装备', // 物品描述
            lvl: 4,
        },


        '0102': {
            name: '一等精铁', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/tie', // 图片 
            desc: '一块精铁，常用于打造低等装备', // 物品描述
            lvl: 1,
            upgrateId: '01022', // 升级后
        },
        '01022': {
            name: '二等精铁', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/tie', // 图片 
            desc: '一块精铁，常用于打造低等装备', // 物品描述
            lvl: 2,
            upgrateId: '01023', // 升级后
        },
        '01023': {
            name: '三等精铁', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/tie', // 图片 
            desc: '一块精铁，常用于打造低等装备', // 物品描述
            lvl: 3,
            upgrateId: '01024', // 升级后
        },
        '01024': {
            name: '四等精铁', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/tie', // 图片 
            desc: '一块精铁，常用于打造低等装备', // 物品描述
            lvl: 4,
        },


        '0103': {
            name: '一等玉', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yu', // 图片 
            desc: '一块美玉，常用于打造低等装备', // 物品描述
            lvl: 1,
            upgrateId: '01032', // 升级后
        },
        '01032': {
            name: '二等玉', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yu', // 图片 
            desc: '一块美玉，常用于打造低等装备', // 物品描述
            lvl: 2,
            upgrateId: '01033', // 升级后
        },
        '01033': {
            name: '三等玉', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yu', // 图片 
            desc: '一块美玉，常用于打造低等装备', // 物品描述
            lvl: 3,
            upgrateId: '01034', // 升级后
        },
        '01034': {
            name: '四等玉', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yu', // 图片 
            desc: '一块美玉，常用于打造低等装备', // 物品描述
            lvl: 4,
        },


        '0104': {
            name: '一等檀木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/chanmu', // 图片 
            desc: '一根檀木，常用于打造低等装备', // 物品描述
            lvl: 1,
            upgrateId: '01042', // 升级后
        },
        '01042': {
            name: '二等檀木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/chanmu', // 图片 
            desc: '一根檀木，常用于打造低等装备', // 物品描述
            lvl: 2,
            upgrateId: '01043', // 升级后
        },
        '01043': {
            name: '三等檀木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/chanmu', // 图片 
            desc: '一根檀木，常用于打造低等装备', // 物品描述
            lvl: 3,
            upgrateId: '01044', // 升级后
        },
        '01044': {
            name: '四等檀木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/chanmu', // 图片 
            desc: '一根檀木，常用于打造低等装备', // 物品描述
            lvl: 4,
        },


        '0105': {
            name: '一等软皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/ruanpi', // 图片 
            desc: '一块软皮，常用于打造低等装备', // 物品描述
            lvl: 1,
            upgrateId: '01052', // 升级后
        },
        '01052': {
            name: '二等软皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/ruanpi', // 图片 
            desc: '一块软皮，常用于打造低等装备', // 物品描述
            lvl: 2,
            upgrateId: '01053', // 升级后
        },
        '01053': {
            name: '三等软皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/ruanpi', // 图片 
            desc: '一块软皮，常用于打造低等装备', // 物品描述
            lvl: 3,
            upgrateId: '01054', // 升级后
        },
        '01054': {
            name: '四等软皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/ruanpi', // 图片 
            desc: '一块软皮，常用于打造低等装备', // 物品描述
            lvl: 4,
        }
    },

    chengpincailiaoLv2: {
        '0106': {
            name: '一等丝绸', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/sichou', // 图片 
            desc: '一匹华美的丝绸，常用于打造高等装备', // 物品描述
            lvl: 1,
            upgrateId: '01062', // 升级后
        },
        '01062': {
            name: '二等丝绸', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/sichou', // 图片 
            desc: '一匹华美的丝绸，常用于打造高等装备', // 物品描述
            lvl: 2,
            upgrateId: '01063', // 升级后
        },
        '01063': {
            name: '三等丝绸', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/sichou', // 图片 
            desc: '一匹华美的丝绸，常用于打造高等装备', // 物品描述
            lvl: 3,
            upgrateId: '01064', // 升级后
        },
        '01064': {
            name: '四等丝绸', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/sichou', // 图片 
            desc: '一匹华美的丝绸，常用于打造高等装备', // 物品描述
            lvl: 4,
        },


        '0107': {
            name: '一等密银', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yin', // 图片 
            desc: '由银矿石提炼的银块，常用于打造高等装备', // 物品描述
            lvl: 1,
            upgrateId: '01072', // 升级后
        },
        '01072': {
            name: '二等密银', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yin', // 图片 
            desc: '由银矿石提炼的银块，常用于打造高等装备', // 物品描述
            lvl: 2,
            upgrateId: '01073', // 升级后
        },
        '01073': {
            name: '三等密银', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yin', // 图片 
            desc: '由银矿石提炼的银块，常用于打造高等装备', // 物品描述
            lvl: 3,
            upgrateId: '01074', // 升级后
        },
        '01074': {
            name: '四等密银', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yin', // 图片 
            desc: '由银矿石提炼的银块，常用于打造高等装备', // 物品描述
            lvl: 4,
        },


        '0108': {
            name: '一等水晶', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/shuijing', // 图片 
            desc: '由水晶石提炼而成，常用于打造高等装备', // 物品描述
            lvl: 1,
            upgrateId: '01082', // 升级后
        },
        '01082': {
            name: '二等水晶', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/shuijing', // 图片 
            desc: '由水晶石提炼而成，常用于打造高等装备', // 物品描述
            lvl: 2,
            upgrateId: '01083', // 升级后
        },
        '01083': {
            name: '三等水晶', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/shuijing', // 图片 
            desc: '由水晶石提炼而成，常用于打造高等装备', // 物品描述
            lvl: 3,
            upgrateId: '01084', // 升级后
        },
        '01084': {
            name: '四等水晶', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/shuijing', // 图片 
            desc: '由水晶石提炼而成，常用于打造高等装备', // 物品描述
            lvl: 4,
        },


        '0109': {
            name: '一等乌木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/wumu', // 图片 
            desc: '由乌木料合成的名贵木料，常用于打造高等装备', // 物品描述
            lvl: 1,
            upgrateId: '01092', // 升级后
        },
        '01092': {
            name: '二等乌木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/wumu', // 图片 
            desc: '由乌木料合成的名贵木料，常用于打造高等装备', // 物品描述
            lvl: 2,
            upgrateId: '01093', // 升级后
        },
        '01093': {
            name: '三等乌木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/wumu', // 图片 
            desc: '由乌木料合成的名贵木料，常用于打造高等装备', // 物品描述
            lvl: 3,
            upgrateId: '01094', // 升级后
        },
        '01094': {
            name: '四等乌木', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/wumu', // 图片 
            desc: '由乌木料合成的名贵木料，常用于打造高等装备', // 物品描述
            lvl: 4,
        },


        '0110': {
            name: '一等硬皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yingpi', // 图片 
            desc: '由硬皮料合成的名贵皮料，常用于打造高等装备', // 物品描述
            lvl: 1,
            upgrateId: '01102', // 升级后
        },
        '01102': {
            name: '二等硬皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yingpi', // 图片 
            desc: '由硬皮料合成的名贵皮料，常用于打造高等装备', // 物品描述
            lvl: 2,
            upgrateId: '01103', // 升级后
        },
        '01103': {
            name: '三等硬皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yingpi', // 图片 
            desc: '由硬皮料合成的名贵皮料，常用于打造高等装备', // 物品描述
            lvl: 3,
            upgrateId: '01104', // 升级后
        },
        '01104': {
            name: '四等硬皮', // 物品名称
            type: 0, // 0 材料 1 符  2 装备
            img: 'img/yingpi', // 图片 
            desc: '由硬皮料合成的名贵皮料，常用于打造高等装备', // 物品描述
            lvl: 4,
        }
    },
}

module.exports = all_cailiao;